Autodesk.Revit.DB.ElementIntersectsSolidFilter.GetSolid
Gets the target solid geometry.
Returns:
The solid geometry.
Since:
2012

Autodesk.Revit.DB.ElementIntersectsSolidFilter.#ctor(Autodesk.Revit.DB.Solid,System.Boolean)
Constructs a filter to match elements which intersect the given element, with the
option to match all elements not intersecting the given element.
solid:
The solid geometry to check for intersection.
inverted:
True if the filter should match all elements which do not intersect the given
element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementIntersectsSolidFilter.#ctor(Autodesk.Revit.DB.Solid)
Constructs a filter to match elements which intersect the given element.
solid:
The solid geometry to check for intersection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementIntersectsSolidFilter
A filter to find elements that intersect the given solid geometry.
Remarks:
The input solid used for this filter can be obtained from an existing element, created from scratch
using the routines in GeometryCreationUtilities or builder classes, or the generated from the result of a
secondary operation such as a Boolean operation. Similar to the Autodesk.Revit.DB.ElementIntersectsElementFilter,
this filter will not detect as intersecting elements which lack solid geometry, such as Rebar.
This filter is a slow filter.
Slow filters require that the Element be obtained and expanded in memory first.
Thus it is preferable to couple this filter with at least one ElementQuickFilter,
which should minimize the number of Elements that are expanded.
Since:
2012